nc: 5 # number of classes
scales:
  # [depth, width, max_channels]
  b: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, Conv_Block, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, Conv_Block, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, Conv_Block, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 1, SMC, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, Conv_Block, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, Conv_Block, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, Conv_Block, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, Conv_Block, [1024]]
  - [[15, 18, 21], 1, Detect, [nc]]

names:
  0: car
  1: two-wheel
  2: pedestrian
  3: bus
  4: truck